int a[5],a;//重复定义的变量
float b;
char c[6][6]; 
struct test{
    int a,b;
    float c[10][20];
}t[1][2][3],tt[1][2],ttt[1],tttt;
int func(int i,int y){
                    //没有返回语句
}
int func(){
    continue;
    break;        //未在循环中使用break
    return 0;   //函数重复定义
}
int main(){
    //this is a test
    int i,tmp;
    char p[10];
    float d = 5.5 , i;  //变量重复定义
    j = i + 1;  //变量在使用时未定义
    inc(i);     //函数在调用时未定义 
    a[i] = 2.2;    //赋值号两边的表达式类型不匹配

    10 = i;         //赋值号左边出现一个只有右值的表达式
    a = a+1;        //操作数类型不匹配(a是数组变量)
    d +=10 ;        //复合运算类型不匹配（d是float型）

    1++;
    --1;
    (i+tmp)++;
    --(i+tmp);      //对非左值表达式进行自增、自减运算

    func();         //函数调用与形参数目不符(过少)
    func(1);      //函数调用与形参数目不符(过少)
    func(2 , 3);      
    func(2 , 3.1);    //函数调用类型不匹配
    func(1 , 2 , 3.1);  //函数调用与形参数目不符(过多)

    func=2;     //对函数名采用非函数调用形式访问

    i[10];          //对非数组型变量使用数组访问操作符
    i(10);          //对普通变量使用函数调用操作符

    p[1.5] = 10;    //数组访问操作符中出现非整数
    i=a[-1];       //下标为负数
    c[1] = 'a';     //数组变量维数错误
    c[1][2] = 'a';
    a[i+1] = a[i+tmp];

    t[1][2].a =1;       //数组变量维数错误
    t[1][2][3].c[2]=1.2; //数组变量维数错误
    t[1][2][3].c[1][2] = 1.2;
    tt[1][2].d = 1 ;
    ttt[1]++;
    ttt[1].a++;             //对结构体变量进行自增、自减运算
    --ttt[1];
    --ttt[1].a;
    none.a = 2; // 对非结构变量采用成员选择运算符“.”
    a.a = 2;


    while(i--){
        break;
        continue;
    }
    return d;       //错误类型8，返回值类型不匹配
}

